[
    {
        "text": "Just saw a LinkedIn coach with 'I help you grow' in their bio... with 300 followers. Maybe they should help themselves first?",
        "engagement": 87
    },
    {
        "text": "Job applications today: 1. Upload resume. 2. Manually fill the same details. 3. Answer unnecessary questions. 4. Never hear back. The real endurance test!",
        "engagement": 243
    },
    {
        "text": "Reminder: Your job title does not define your worth. Your skills, resilience, and character do. Keep pushing!",
        "engagement": 512
    },
    {
        "text": "LinkedIn motivation be like: 'I woke up at 4 AM, ran 10 miles, built a startup, closed 3 deals, and still had time to meditate. No excuses!'",
        "engagement": 329
    },
    {
        "text": "Interviews that go like: 'Where do you see yourself in 5 years?' Me: 'Hopefully not still answering this question.'",
        "engagement": 191
    },
    {
        "text": "Sending 50 applications per day won’t guarantee a job, but improving your skills, networking, and persistence will. Work smart, not just hard!",
        "engagement": 678
    },
    {
        "text": "If you’re struggling with job rejections, remember: The company that rejected you today might not even exist in 5 years. Keep going!",
        "engagement": 812
    },
    {
        "text": "LinkedIn flex posts be like: 'I turned down a $500K offer because I value work-life balance.' Bro, I just want a reply from HR!",
        "engagement": 440
    },
    {
        "text": "You don’t need a fancy title or a top company’s name to prove your worth. Your skills and dedication speak louder than any brand!",
        "engagement": 365
    },
    {
        "text": "Ghosting candidates after multiple interview rounds should be illegal. Respect people’s time!",
        "engagement": 733
    },
    {
        "text": "People who give unpaid internship offers be like: 'We offer great exposure.' Yes, exposure to financial struggles!",
        "engagement": 298
    },
    {
        "text": "If your work makes you miserable every single day, it’s time to rethink your career path. You deserve better!",
        "engagement": 940
    },
    {
        "text": "Every LinkedIn success story starts with: 'I had only $5 in my pocket...' Bro, I still have $5. Where’s my success?",
        "engagement": 522
    },
    {
        "text": "Rejection doesn’t mean you’re not good enough. It means that opportunity wasn’t meant for you. The right one will come!",
        "engagement": 811
    },
    {
        "text": "'We’re like a family here' = We expect you to work overtime for free.",
        "engagement": 673
    },
    {
        "text": "'Looking for freshers with 5 years of experience.' Corporate logic never fails to amaze me!",
        "engagement": 446
    },
    {
        "text": "Success isn’t just landing a job. It’s about finding work that aligns with your values and goals. Don’t settle!",
        "engagement": 789
    },
    {
        "text": "LinkedIn posts be like: 'I got fired, started a business, and now make $1M a year!' Meanwhile, I just want my recruiter to reply.",
        "engagement": 542
    },
    {
        "text": "Companies want loyalty but will lay you off in a heartbeat. Always look out for yourself first!",
        "engagement": 855
    },
    {
        "text": "The moment you start prioritizing your mental health over toxic work environments, your life will change!",
        "engagement": 932
    },
    {
        "text": "Remember: LinkedIn is half networking, half people pretending their life is perfect. Don’t compare, just grow!",
        "engagement": 610
    },
    {
        "text": "Networking tip: Instead of asking for a job, build genuine connections. People help those they trust!",
        "engagement": 784
    },
    {
        "text": "A reminder: Your worth isn’t defined by a job offer. You are valuable regardless!",
        "engagement": 869
    },
    {
        "text": "Me scrolling LinkedIn: 'Wow, everyone’s successful except me.' Me remembering LinkedIn is a highlight reel: 'Never mind.'",
        "engagement": 470
    },
    {
        "text": "Companies: 'We value employees!' Also companies: 'We won’t be paying you for your extra hours, but thanks.'",
        "engagement": 510
    },
    {
        "text": "Recruiters: 'We need someone passionate about this role.' Also recruiters: 'The salary is exposure.'",
        "engagement": 399
    },
    {
        "text": "Hustle culture is overrated. Work hard, but don’t forget to live your life too!",
        "engagement": 891
    },
    {
        "text": "Being rejected doesn’t mean you’re not good enough. It means that opportunity wasn’t the right fit. Keep going!",
        "engagement": 930
    },
    {
        "text": "If you wouldn’t hire someone unpaid to work for you, don’t expect people to do unpaid internships. Fair pay matters!",
        "engagement": 799
    }
]